<?php

use Illuminate\Database\Seeder;
use App\City;

class CitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $cities = ["ကချင်ပြည်နယ်","ကယားပြည်နယ်","ကရင်ပြည်နယ်","ချင်းပြည်နယ်","စစ်ကိုင်းတိုင်း","တနင်္သာရီတိုင်း","ပဲခူးတိုင်း အရှေ့","ပဲခူးတိုင်း အနောက်","မကွေးတိုင်း","မန္တလေးတိုင်း","မွန်ပြည်နယ်","ရခိုင်ပြည်နယ်","ရန်ကုန်တိုင်း","ရှမ်းပြည်နယ် တောင်ပိုင်း","ရှမ်းပြည်နယ် မြောက်ပိုင်း","ရှမ်းပြည်နယ် အရှေ့ပိုင်း","ဧရာဝတီတိုင်း","နေပြည်တော်တိုင်း"
        ];
        for ($i=0; $i < 18; $i++) {  
            $City = new City();
            $City->city_name = $cities[$i];          
            $City->save();
     }
    }
}
